#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.main.data.aws_iam_policy_document.ecs-instance-policy: Reading...
module.main.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:991585416715:cluster/ecs-pw-pusher-api-dev]
module.main.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0d187be2495c7f79b]
module.main.aws_ecs_task_definition.task_definition: Refreshing state... [id=pw-pusher-api-dev]
module.main.aws_acm_certificate.ssl_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:991585416715:certificate/5b9eca0d-1016-489e-a4e6-5eff8be14567]
module.main.data.aws_iam_policy_document.ecs-instance-policy: Read complete after 0s [id=2851119427]
module.main.data.aws_iam_policy_document.ecsInstanceRole-policy: Reading...
module.main.data.aws_iam_policy_document.ecs_agent: Reading...
module.main.data.aws_iam_policy_document.ecs_agent: Read complete after 0s [id=2851119427]
module.main.aws_iam_role.ecs_agent: Refreshing state... [id=pw-pusher-api-ecs-agent-dev]
module.main.data.aws_iam_policy_document.ecsInstanceRole-policy: Read complete after 0s [id=2851119427]
module.main.aws_iam_role_policy_attachment.ecs_agent: Refreshing state... [id=pw-pusher-api-ecs-agent-dev-20230704110845391900000002]
module.main.aws_iam_role_policy_attachment.Cloudwatch_FullAccess: Refreshing state... [id=pw-pusher-api-ecs-agent-dev-20230704110845461300000003]
module.main.aws_iam_instance_profile.ecs_agent: Refreshing state... [id=pw-pusher-api-ecs-agent-dev]
module.main.aws_acm_certificate_validation.cert_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.main.aws_route53_record.hello_cert_dns: Refreshing state... [id=Z0564497X9NS1YH2WRF5__1d670b3bdc5cb01c828d764eacf488b7.dev.pw-pusher.click._CNAME]
module.main.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-07e2f27fdd3d93ae4]
module.main.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0ba80082038e632b3]
module.main.aws_security_group.ec2: Refreshing state... [id=sg-00907e7cd41433532]
module.main.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00a1d6b6ee7cc4b62]
module.main.aws_security_group.public: Refreshing state... [id=sg-019a013d12eb4eaba]
module.main.aws_alb_target_group.alb_public_webservice_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:991585416715:targetgroup/public-pw-pusher-api-tg-dev/2ee5e19884c7708e]
module.main.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-04be19e3df0bbbe9d]
module.main.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06eeab0878b1230ec]
module.main.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0fd834634e50ea99b]
module.main.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f42eb5174ffe60e8]
module.main.aws_security_group_rule.public_in_https: Refreshing state... [id=sgrule-4289847889]
module.main.aws_security_group_rule.public_out: Refreshing state... [id=sgrule-807961901]
module.main.aws_security_group_rule.ec2_out: Refreshing state... [id=sgrule-1501248]
module.main.aws_security_group_rule.ec2_in_http: Refreshing state... [id=sgrule-2216731582]
module.main.aws_security_group_rule.public_in_http: Refreshing state... [id=sgrule-155240756]
module.main.aws_lb.loadbalancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:991585416715:loadbalancer/app/pw-pusher-api-alb-dev/d0a312728c63103a]
module.main.aws_instance.ec2_instance: Refreshing state... [id=i-0a66b3d6aaf79b760]
module.main.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-05fb72addc4c60614]
module.main.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0dfb9b9561921be95]
module.main.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-04be19e3df0bbbe9d1080289494]
module.main.aws_ecs_service.service-webservice: Refreshing state... [id=arn:aws:ecs:eu-central-1:991585416715:service/ecs-pw-pusher-api-dev/pw-pusher-api-service-dev]
module.main.aws_route53_record.www: Refreshing state... [id=Z0564497X9NS1YH2WRF5_dev.pw-pusher.click_A]
module.main.aws_lb_listener.lb_listener-webservice-https-redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:991585416715:listener/app/pw-pusher-api-alb-dev/d0a312728c63103a/1ac6bce394cdf83a]
module.main.aws_lb_listener.lb_listener-webservice-https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:991585416715:listener/app/pw-pusher-api-alb-dev/d0a312728c63103a/da5fc73887cfe8a6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.main.data.aws_iam_policy_document.sns_topic_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sns_topic_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
              + "SNS:Receive",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "budgets.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.main.aws_budgets_budget.budget_account will be created
  + resource "aws_budgets_budget" "budget_account" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "1"
      + limit_unit        = "USD"
      + name              = "Account Monthly Budget - pw-pusher dev"
      + name_prefix       = (known after apply)
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = "2020-01-01_00:00"
      + time_unit         = "MONTHLY"

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = []
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 70
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "FORECASTED"
          + subscriber_email_addresses = []
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.main.aws_budgets_budget.budget_resources["AWS Key Management Service"] will be created
  + resource "aws_budgets_budget" "budget_resources" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "0.1"
      + limit_unit        = "USD"
      + name              = "pw-pusher dev AWS Key Management Service Monthly Budget"
      + name_prefix       = (known after apply)
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = "2020-01-01_00:00"
      + time_unit         = "MONTHLY"

      + cost_filter {
          + name   = "Service"
          + values = [
              + "AWS Key Management Service",
            ]
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = []
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.main.aws_budgets_budget.budget_resources["Amazon EC2 Container Service"] will be created
  + resource "aws_budgets_budget" "budget_resources" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "0.1"
      + limit_unit        = "USD"
      + name              = "pw-pusher dev Amazon EC2 Container Service Monthly Budget"
      + name_prefix       = (known after apply)
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = "2020-01-01_00:00"
      + time_unit         = "MONTHLY"

      + cost_filter {
          + name   = "Service"
          + values = [
              + "Amazon EC2 Container Service",
            ]
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = []
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.main.aws_budgets_budget.budget_resources["Amazon Elastic Compute Cloud - Compute"] will be created
  + resource "aws_budgets_budget" "budget_resources" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "0.1"
      + limit_unit        = "USD"
      + name              = "pw-pusher dev Amazon Elastic Compute Cloud - Compute Monthly Budget"
      + name_prefix       = (known after apply)
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = "2020-01-01_00:00"
      + time_unit         = "MONTHLY"

      + cost_filter {
          + name   = "Service"
          + values = [
              + "Amazon Elastic Compute Cloud - Compute",
            ]
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = []
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.main.aws_budgets_budget.budget_resources["Amazon Elastic Load Balancing"] will be created
  + resource "aws_budgets_budget" "budget_resources" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "0.1"
      + limit_unit        = "USD"
      + name              = "pw-pusher dev Amazon Elastic Load Balancing Monthly Budget"
      + name_prefix       = (known after apply)
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = "2020-01-01_00:00"
      + time_unit         = "MONTHLY"

      + cost_filter {
          + name   = "Service"
          + values = [
              + "Amazon Elastic Load Balancing",
            ]
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = []
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.main.aws_budgets_budget.budget_resources["Amazon Route 53"] will be created
  + resource "aws_budgets_budget" "budget_resources" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "0.5"
      + limit_unit        = "USD"
      + name              = "pw-pusher dev Amazon Route 53 Monthly Budget"
      + name_prefix       = (known after apply)
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = "2020-01-01_00:00"
      + time_unit         = "MONTHLY"

      + cost_filter {
          + name   = "Service"
          + values = [
              + "Amazon Route 53",
            ]
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = []
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.main.aws_budgets_budget.budget_resources["Amazon Simple Storage Service"] will be created
  + resource "aws_budgets_budget" "budget_resources" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "0.1"
      + limit_unit        = "USD"
      + name              = "pw-pusher dev Amazon Simple Storage Service Monthly Budget"
      + name_prefix       = (known after apply)
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = "2020-01-01_00:00"
      + time_unit         = "MONTHLY"

      + cost_filter {
          + name   = "Service"
          + values = [
              + "Amazon Simple Storage Service",
            ]
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = []
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.main.aws_budgets_budget.budget_resources["AmazonCloudWatch"] will be created
  + resource "aws_budgets_budget" "budget_resources" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "0.1"
      + limit_unit        = "USD"
      + name              = "pw-pusher dev AmazonCloudWatch Monthly Budget"
      + name_prefix       = (known after apply)
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = "2020-01-01_00:00"
      + time_unit         = "MONTHLY"

      + cost_filter {
          + name   = "Service"
          + values = [
              + "AmazonCloudWatch",
            ]
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = []
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.main.aws_ecs_service.service-webservice will be updated in-place
  ~ resource "aws_ecs_service" "service-webservice" {
        id                                 = "arn:aws:ecs:eu-central-1:991585416715:service/ecs-pw-pusher-api-dev/pw-pusher-api-service-dev"
        name                               = "pw-pusher-api-service-dev"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:991585416715:task-definition/pw-pusher-api-dev:16" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.main.aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:991585416715:task-definition/pw-pusher-api-dev:16" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:991585416715:task-definition/pw-pusher-api-dev" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image            = "ghcr.io/jos1k/passwordpusher-api:sha-af17987" -> "ghcr.io/jos1k/passwordpusher-api:sha-6b0026a"
                    name             = "pw-pusher-api-dev"
                    # (11 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "pw-pusher-api-dev" -> (known after apply)
      ~ revision                 = 16 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.main.aws_sns_topic.account_billing_alarm_topic will be created
  + resource "aws_sns_topic" "account_billing_alarm_topic" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "pw-pusher-account-billing-alarm-topic-dev"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.main.aws_sns_topic_policy.account_billing_alarm_policy will be created
  + resource "aws_sns_topic_policy" "account_billing_alarm_policy" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

  # module.main.aws_sns_topic_subscription.billing_alarm_email_subscription will be created
  + resource "aws_sns_topic_subscription" "billing_alarm_email_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "ihor.hadzera+pw-pusher-dev@gmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 12 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

```

</details>

*Pusher: @Jos1k, Action: `pull_request`, Working Directory: `infrastructure/dev`, Workflow: `Build and Deploy Dev`*